---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet
source: html/ce3c8e90-566c-bb8e-57f7-06f10dac5b7c.htm
---
# Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet

A set of interrelated mechanical equipment in a MEP system that works together.

## Syntax (C#)
```csharp
public class MechanicalEquipmentSet : Element
```